CSI API ETABS v1
cPropFrameSDShape Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cPropFrameSDShape
Public Interface cPropFrameSDShape
Dim instance As cPropFrameSDShape
public interface class cPropFrameSDShape
type cPropFrameSDShape =  interface end
The cPropFrameSDShape type exposes the following members.
Methods
Name | Description
GetAngle
 Retrieves property data for an Angle shape in a section designer section
GetConcreteL
 Retrieves property data for a concrete L shape in a section designer section
GetConcreteTee
 Retrieves property data for a concrete tee shape in a section designer section
GetISection
 Retrieves property data for an I-section shape in a section designer section
GetReinfCircle
 Retrieves property data for a circular reinforcing shape in a section designer section
GetReinfCorner
 Retrieves corner point reinforcing data for solid rectangle, circle and polygon shapes in a section designer property
GetReinfEdge
 Retrieves edge reinforcing data for solid rectangle, circle, polygon, and rectangular reinforcing shapes in a section designer property
GetReinfLine
 Retrieves property data for a line reinforcing shape in a section designer section
GetReinfRectangular
 Retrieves property data for a rectangular reinforcing shape in a section designer section
GetReinfSingle
 Retrieves property data for a single bar reinforcing shape in a section designer section
GetSolidCircle
 Retrieves property data for a solid circle shape in a section designer section
GetSolidRect
 Retrieves property data for a solid rectangular shape in a section designer section
GetTee
 Retrieves property data for a Tee shape in a section designer section
Top
See Also
Reference
ETABSv1 Namespace